routes/web.php

});

Route::get('/bugs', function () {
    $bugs = Bug::all()->sort();
---
select * from "bugs"

});

Route::get('/bug/{id}', function (int $id) {
    $bug = Bug::find($id);
---
select * from "bugs" where "bugs"."id" = 3 limit 1